Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/mental_health/rights_of_psychiatric_patients.html.txt.tmx
Source language: en
Languages: ga

source: Rights of psychiatric patients
ga: Cearta na n-othar síciatrach

source: The Mental Health Act 2001 provides for, among other things, rules about admission to psychiatric hospitals and rules about the rights of psychiatric patients
ga: Foráiltear san Acht Meabhair-Shláinte 2001, i measc nithe eile, do rialacha faoi iontráil isteach chuig ospidéil síciatracha agus do rialacha faoi chearta na n-othar síciatrach

source: If you are involuntarily admitted to an approved psychiatric centre, you are entitled to:
ga: Má iontráiltear go neamhshaorálach tú chuig lárionad síciatrach formheasta, bíonn tú i dteideal:

source: • Have all decisions made in your best interests
ga: • •Chun gach cinneadh a fháil chun do leasasa

source: • Be examined by a psychiatrist in the centre
ga: • •Chun scrúdú a fháil ó shíciatraí sa lárionad

source: • Be provided with certain information
ga: • •Chun faisnéis áirithe a fháil

source: • Have your retention reviewed by a tribunal
ga: • •Chun do choinneáil a athbhreithniú ag binse (meabhair-shláinte)

source: • Appeal to the Courts in certain circumstances
ga: • •Chun achomharc a thabhairt chuig na Cúirteanna i gcúinsí áirithe

source: There are specific rules about psychiatric patients and their consent to treatment
ga: Baineann rialacha sonracha le hothair shíciatracha agus lena dtoiliú do chóireáil

source: Under the Mental Health Act 2001, when people are admitted or are receiving treatment in approved centres (that is, psychiatric hospitals or inpatient services), their best interests should be considered before any decision about their care and treatment is made
ga: De réir an tAcht Meabhair-Shláinte 2001, ba cheart go mbreithneofaí leas na ndaoine sula nglactar aon chinneadh i leith a gcúraim agus a gcóireála nuair a iontráiltear isteach nó nuair a fhaigheann siad cóireáil in ionaid fhormheasta (eadhon ospidéil síciatracha nó seirbhísí othar cónaitheach)

source: Patients have the right to be treated with dignity and respect and the right to be listened to by all those working on their care team
ga: Bíonn an ceart ag othair go gcaitear leo le dínit agus le hurraim agus bíonn an ceart acu go n-éisteann iad siúd go léir a oibríonn ina mbuíon chúraim leo

source: They should be included in discussions with their care team
ga: Ba chóir go n-áireofaí iad i gcomhphléanna lena mbuíon chúraim

source: They are entitled to take part in decisions that affect their health and their care team should consider their views carefully
ga: Bíonn siad i dteideal chun rannpháirt a ghlacadh i gcinntí a théann i bhfeidhm ar a gcuid sláinte agus ba cheart go mbreithneodh a mbuíon chúraim a gcuid tuairimí go cúramach

source: They have the right to be fully informed about their legal rights, their admission and treatment
ga: Bíonn an ceart acu bheith go hiomlán ar an eolas i leith a gceart de réir an dlí, a n-iontrála agus a gcóireála

source: Admission to an approved psychiatric centre
ga: Iontráil isteach chuig ionad síciatrach formheasta

source: When you are received at an approved psychiatric centre, you must be examined by a consultant psychiatrist on the staff
ga: Caithfidh síciatraí is comhairleach ar ball foirne iad scrúdú a chur ort nuair a iontráiltear tú isteach chuig ionad síciatrach formheasta

source: You may be detained for a maximum of 24 hours in the centre for this examination
ga: Is féidir tú a choinneáil san ionad i gcomhair an scrúdaithe sin ar feadh 24 uair ar a mhéad

source: If the psychiatrist is satisfied that you are suffering from a mental disorder, they then make an admission order
ga: Má tá an síciatraí sásta go bhfuil neamhord meabhrach ag baint duit, is amhlaidh a dhéanann siad ordú iontrála

source: If the psychiatrist is not satisfied that you are suffering from a mental disorder, you must be released immediately
ga: Mura bhfuil an síciatraí sásta go bhfuil neamhord meabhrach ag baint duit, is amhlaidh a chaithfear tú a scaoileadh saor láithreach bonn

source: The admission order is valid for 21 days
ga: Maireann an t-ordú iontrála go bailí ar feadh 21 lá

source: It authorises your reception, detention and treatment in the centre for this period
ga: Is leis a údaraítear d’iontráil, do choinneáil agus do chóireáil san ionad ar feadh na tréimhse úd

source: A renewal order may extend this period by a further 3 months
ga: Is féidir an tréimhse sin a shíneadh ach ordú athnuachana a dhéanamh faoi 3 mhí breise

source: This must be made by the consultant psychiatrist responsible and they must have examined you in the week before making the order
ga: Is iad an síciatraí is comhairleach atá freagrach a chaitheann é sin a dhéanamh, agus ní foláir go ndearna siad scrúdú ort sa tseachtain sula ndearnadh an t-ordú

source: A further renewal order may be made by the same psychiatrist for a period of 6 months and subsequently for 12 months at a time
ga: Is féidir leis an síciatraí céanna ordú athnuachana breise a dhéanamh ar feadh tréimhse 6 mhí agus ar feadh 12 mí i ndiaidh a chéile dá éis sin

source: Your right to information
ga: Do cheart chun faisnéise

source: Each time an admission order or a renewal order is made, a copy must be given to the Mental Health Commission and a notice in writing must be given to the patient
ga: Caithfear cóip a thabhairt don Coimisiún Meabhair-Shláinte gach uair a dhéantar ordú iontrála nó ordú athnuachana, agus caithfear fógra i scríbhinn a thabhairt don othar féin

source: The notice to you, the patient, must include the following information:
ga: Caithfear an t-eolas seo a leanas a áireamh san fhógra duitse, an t-othar:

source: • You are being detained under the Mental Health Act and the relevant section
ga: • Go bhfuiltear do do choinneáil faoin Acht Meabhair-Shláinte agus an chuid ábhartha de

source: • You are entitled to legal representation
ga: • Go bhfuil tú i dteideal ionadaíocht dhlíthiúil a fháil

source: • You will be given a general description of the treatment recommended for you during the detention
ga: • Go dtabharfar tuairisc ghinearálta den chóireáil a mholtar duit le linn na coinneála

source: • You are entitled to communicate with the Inspector of Mental Health Services
ga: • Go bhfuil tú i dteideal cumarsáid a dhéanamh le Cigire na Seirbhísí Meabhair-Shláinte

source: • You will have the detention reviewed by a mental health tribunal
ga: • Go ndéanfaidh binse meabhairshláinte an choinneáil a athbhreithniú

source: • You are entitled to appeal to the Circuit Court against a decision of a tribunal
ga: • Go bhfuil tú i dteideal achomharc chun na Cúirte Cuarda i gcoinne chinneadh an bhinse

source: • You may be admitted as a voluntary patient if you wish
ga: • Go n-iontrálfar isteach mar othar saorálach más mian leat

source: Review of admission by a mental health tribunal
ga: Athbhreithniú na hiontrála ag binse meabhairshláinte

source: When the Mental Health Commission receives a copy of an admission or renewal order, it must
ga: Ní mór don Coimisiún Meabhair-Shláinte nuair a fhaigheann sé cóip d’ordú iontrála nó athnuachana,

source: • Refer the matter to a mental health tribunal
ga: • an t-ábhar a tharchur do bhinse meabhairshláinte

source: • Assign a legal representative to represent you unless you personally engage one
ga: • Ionadaí dlíthiúila a shannadh mar ionadaí duit mura bhfostaíonn tú ceann duit féin

source: • Arrange for another consultant psychiatrist to examine you, interview the consultant responsible for your treatment and care and review your records in order to decide whether you are suffering from a mental disorder
ga: • Scrúdú ortsa a chur in eagar ag síciatraí eile is comhairleach, an comhairleach atá freagrach as do chóireáil agus do chúram a chur faoi agallamh, agus do thaifid a athbhreithniú d’fhonn teacht ar chinneadh an bhfuil neamhord meabhrach ag baint duit

source: The tribunal's report must be given within 14 days to the Commission and to your legal representative
ga: Caithfear tuairisc an bhinse a thabhairt laistigh de 14 lá chuig an gCoimisiún agus chuig d’ionadaí dlíthiúil

source: The tribunal must review your detention and make a decision within 21 days of the making of the order (there are provisions for extending this time limit)
ga: Caitheann an binse do choinneáil a athbhreithniú agus cinneadh a ghlacadh laistigh de 21 lá ó dhéanamh an ordaithe (tá forálacha ann chun síneadh a chur leis an teorainn ama sin)

source: If it is satisfied that you are suffering from a mental disorder and that the proper procedures have been followed (or, if they have not, the failure does not affect the substance of the order and does not cause an injustice) then it affirms the order
ga: Má tá sé sásta go bhfuil neamhord meabhrach ag baint duit agus gur leanadh na nósanna imeachta iomchuí (nó, murar leanadh, nach ndéanann an teip dochar do bhrí an ordaithe agus nach cúis le héagóir é) is amhlaidh a dhearbhaíonn sé an t-ordú

source: If it is not satisfied, it revokes the order and directs that you be discharged
ga: Mura bhfuil sé sásta, is amhlaidh a aisghaireann sé an t-ordú agus a thugann treoir go scaoiltear saor tú

source: The tribunal has similar powers to a court, including the power to require the attendance of the relevant people and the production of documents
ga: Is cosúil le cumhachtaí na cúirte iad cumhachtaí an bhinse, lena n-áirítear an chumhacht chun freastal daoine ábhartha agus táirgeadh cáipéisí a ordú

source: The tribunal is, of course, obliged to respect the usual requirements of natural justice, for example, it must ensure that you have copies of the reports that are being considered by the tribunal
ga: Ní mór don bhinse, ar ndóigh, urraim a thabhairt do ghnáthriachtanais an cheartais aiceanta, mar shampla ní foláir dó a chinntiú go bhfuil cóipeanna agat de na tuairiscí a bhfuil an binse á mbreithniú

source: The tribunal must notify its decision, in writing, to
ga: Caitheann an binse a chinneadh a fhógairt i scríbhinn chuig

source: • The psychiatrist responsible for your care and treatment
ga: • An síciatraí atá freagrach as do chúram agus as do chóireál

source: • You and your legal representative
ga: • Tusa agus d’ionadaí dlíthiúil

source: • Any other person the tribunal considers should be notified
ga: • Aon duine eile a measann an Binse go mba chóir fógra a thabhairt dóibh

source: The tribunal is appointed by the Mental Health Commission
ga: Is é An Coimisiún Meabhair-Shláinte a cheapann an binse

source: It must consist of a lawyer as chairman, a consultant psychiatrist and a lay person (a person who is not a lawyer or doctor)
ga: Caitheann dlíodóir feidhmiú mar chathaoirleach air, síciatraí is comhairleach amháin agus duine tuata (duine éigin nach dlíodóir ná lia iad)

source: Tribunal members have been selected and trained by the Mental Health Commission
ga: Is é An Coimisiún Meabhair-Shláinte a roghnaigh agus a chuir oiliúint ar na baill den bhinse

source: Appeal to the Circuit Court
ga: Achomharc chun na Cúirte Cuarda

source: You may appeal to the Circuit Court (within 14 days) against a decision to affirm an order
ga: Is féidir leat achomharc a thabhairt chun na Cúirde Cuarda (laistigh de 14 lá) i gcoinne cinnidh chun an t-ordú a dhearbhú

source: At this stage, it is up to you, the patient, to prove your case that you are not suffering from a mental disorder
ga: Is fútsa, mar an t-othar, atá sé ag an iarraidh sin, chun do chás a chruthú nach bhfuil neamhord meabhrach ag baint duit

source: There are certain restrictions on taking civil actions in court arising from actions taken under the Mental Health Act
ga: Baineann srianta áirithe le tógáil caingne sibhialta sa chúirt ag éirí as caingne a tógadh faoin Acht Meabhair-Shláinte

source: You need to get the permission of the High Court before taking civil proceedings in respect of any act done in carrying out the functions of the Mental Health Act
ga: Caitheann tú cead na hArd-Chúirte a fháil sula nglacann tú imeachtaí sibhialta i ndáil le haon ghníomh a rinneadh i gcleachtadh fheidhmeanna an tAcht Meabhair-Shláinte

source: The High Court must not refuse such permission unless it is satisfied that the proceedings are either frivolous or vexatious or that there are no reasonable grounds for contending that the person against whom the proceedings are brought acted in bad faith or without reasonable care
ga: Caithfidh nach ndiúltaíonn an Ard-Chúirt do chead mar sin mura mbíonn sí sásta gur baoth nó cráiteach iad na himeachtaí, nó nach bhfuil forais réasúnta ann chun áitiú gur fheidhmigh an duine a bhfuiltear ag tabhairt na n-imeachtaí ina n-aghaidh go fealltach nó gan cúram réasúnta

source: The court is not allowed to determine the proceedings in favour of the patient unless it is satisfied that the person against whom the proceedings are brought acted in bad faith or without reasonable care
ga: Ní cheadaítear don chúirt na himeachtaí a bhreithniú i bhfabhar an othair mura mbíonn sí sásta gur fheidhmigh an duine a bhfuiltear ag tabhairt na n-imeachtaí ina n-aghaidh go fealltach nó gan cúram réasúnta

source: Consent to psychiatric treatment
ga: Toiliú do chóireáil shíciatrach

source: In general, medical and surgical treatment may be administered only with the informed consent of the patient
ga: Ní féidir cóireáil míochaine agus máinliachta a thabhairt go ginearálta ach amháin le toiliú eolasach an othair

source: The law is different in the case of psychiatric patients
ga: Is éagsúil é an dlí i gcás na n-othar síciatrach

source: For the purposes of the Mental Health Act 2001, consent means consent in writing, obtained freely without threats or inducements, where:
ga: Chun críocha an tAch Meabhair-Shláinte 2001, ciallaíonn toiliú toiliú i bhfoirm scríbhinne, a fhaightear go saor gan bhagairtí ná dreasachtaí, más amhlaidh:

source: • The consultant psychiatrist who is caring for you certifies that you are capable of understanding the nature, purpose and likely effects of the proposed treatment and
ga: • A dheimhníonn an síciatraí is comhairleach atá ag tabhairt cúraim duit gur féidir leat cineál, cuspóir agus éifeachtaí dóchúla na cóireála molta a thuiscint, agus

source: • The psychiatrist has given you adequate information, in a form and a language that you can understand, on the nature, purpose and likely effects of the proposed treatment
ga: • A thug an síciatraí dóthain eilais duit, ar bhealach agus i dteanga ar féidir leat a thuiscint, maidir le cineál, cuspóir agus éifeachtaí dóchúla na cóireála molta

source: Under the Act, your consent to treatment is required except where the consultant psychiatrist considers that the treatment is necessary to safeguard your life, to restore your health, to alleviate your condition or to relieve your suffering, and you are incapable of giving such consent because of your mental disorder
ga: Teastaíonn do thoiliú chun cóireála de réir an Achta, ach amháin mar a measann an síciatraí is comhairleach gurb éigeantach é an chóireáil chun do bheatha a chosaint, chun do shláinte a aiseag, chun faoiseamh a fháil ó do riocht nó chun faoiseamh ón bhfulaingt a fháil duit, nach féidir leat an toiliú sin a thabhairt mar gheall ar do neamhord meabhrach

source: Psycho-surgery may not be performed unless you consent and it is authorised by a mental health tribunal
ga: Ní dhéanfar síc-mháinliacht mura n-údaraítear do thoiliú ag binse meabhair-shláinte

source: Electro-convulsive therapy may not be performed unless you give consent or where you are unable to give consent and the therapy is authorised by the consultant psychiatrist responsible for you and by another consultant psychiatrist
ga: Ní féidir teiripe leictri-thritheamhach a dhéanamh mura dtugann tú toiliú nó mura féidir leat toiliú a thabhairt agus gurb é an síciatraí is comhairleach atá freagrach asat agus síciatraí éigin eile is comhairleach a thugann údarú don teiripe

source: If you are getting medicine for the amelioration of the mental disorder for a period of 3 months, the medicine must be discontinued unless you consent or, where you are unable to give consent, the continued medication is authorised by the consultant psychiatrist responsible for you and by another consultant psychiatrist
ga: Má bhíonn tú ag fáil cógais do mhaolú neamhoird mheabhrach ar feadh tréimhse 3 mhí, caithfear an cógas a bhaint mura dtugann tú toiliú nó, mura féidir leat toiliú a thabhairt agus gurb é an síciatraí is comhairleach atá freagrach asat agus síciatraí éigin eile is comhairleach a thugann údarú don chógas

source: Patients may not be restrained or placed in seclusion unless this is necessary for treatment or to prevent the patients from injuring themselves
ga: Ní féidir othair a shrianadh ná a leithlisiú murarb éigeantach é do chóireáil nó chun cosc a chur leis an othar ag déanamh díobhála dóibh féin

source: The Commission has made rules for the use of seclusion and mechanical means of bodily restraint
ga: Cheap an Coimisiún rialacha d’úsáid an leithlisaithe agus na meán srianta colanda meicniúil

source: There is a Code of Practice on the use of Physical Restraint in Approved Centres
ga: Tá Cód Cleachtais ann d’úsáid an tSrianta Cholanda in Ionaid Fhormheasta

source: People who are suffering from a mental disorder and who have been admitted to an approved centre may not take part in clinical trials
ga: Daoine a mbaineann neamhord meabhrach dóibh agus a iontráladh chuig ionad formheasata; ní féidir leo rannpháirt a ghlacadh i dtrialacha cliniciúla

source: The Mental Health Commission has published a guide to the Mental Health Act 2001 that explains your rights under mental health law
ga: D’fhoilsigh an Coimisiún Meabhair-Shláinte treoir don Acht Meabhair-Shláinte 2001 ina mínítear do chearta faoin dlí meabhair-shláinte
